let handler = m => m;

handler.all = async function(m) {
  // Access the chat object in the global database
  let chat = global.db.data.chats[m.chat];

  // Define the responses
  let responses;
  if (/^تع$/i.test(m.text)) {
    responses = [
      // Prompts (3 / *Category*)
      '3 / *هاشيرا*', '3 / *قبعة القش*', '3 / *طاقم روجر*', '3 / *طاقم اللحيه*', '3 / *طاقم نيوقيت*', '3 / *بحرية*', '3 / *هوكاجي*', '3 / *كاجي*', '3 / *سانين*', '3 / *بليتش*', '3 / *قادة*', '3 / *جنرالات*', '3 / *كينقدوم*', '3 / *ارانكار*', '3 / *فول ميتال*', '3 / *كيميتسو*', '3 / *شياطين*', '3 / *بلاك كلوفر*', '3 / *قمر علوي*', '3 / *ثالوث اعظم*', '3 / *اسبادا*', '3 / *نواب*', '3 / *معجزات*', '3 / *فايزارد*', '3 / *يونكو*', '3 / *انتيك*', '3 / *غريمات*',
      '3 / *سيراف النهاية*', '3 / *ديث نوت*', '3 / *عمالقة*', '3 / *ثيران سوداء*', '3 / *قادة سحر*', '3 / *تنانين*', '3 / *اكرمان*', '3 / *اوتشيها*', '3 / *زودياك*', '3 / *الفريق السابع*', '3 / *سوبر نوفا*', '3 / *طاقم دوفلامينجو*', '3 / *فريكس*', '3 / *فريق الاستطلاع*', '3 / *محققين*', '3 / *نواب قادة*', '3 / *منظمة سوداء*', '3 / *حكام دمار*', '3 / *حرس ميرويم*', '3 / *طاقم تيتش*', '3 / *زولديك*', '3 / *ثوار*', '3 / *سيافين*', '3 / *طلاب جوجيتسو*', '3 / *كونوها*', '3 / *قرية الرمل*', '3 / *ادميرالات*', '3 / *طاقم لوفي*', '3 / *سينجو*', '3 / *نارا*', '3 / *سايان*', '3 / *سفن*', '3 / *كودو*', '3 / *شينيجامي*', '3 / *خطايا*', '3 / *وصايا*', '3 / *اوزوماكي*', '3 / *ابطال*', '3 / *اطفال*', '3 / *بلو لوك*', '3 / *اكسيد*', '3 / *طاقم شانكس*', '3 / *اكاتسكي*', '3 / *تشيبوكاي*', '3 / *اطلاقات*', '3 / *غيلان*', '3 / *اوتسوتسوكي*', '3 / *قراصنة*', '3 / *جينشوريكي*', '3 / *بيجو*', '3 / *كاراسونو*', '3 / *انمي المنشار*', '3 / *زينين*', '3 / *لعنات*', '3 / *مستخدمي نار*', '3 / *ياماناكا*', '3 / *كوينشي*', '3 / *جنرالات حلوى*', '3 / *جينتاما*', '3 / *طاقم روكس*', '3 / *كوتشيكي*', '3 / *دي*', '3 / *يوجين*', '3 / *مدربين ناروتو*', '3 / *اف بي اي*', '3 / *فريق ساسكي*', '3 / *مونستر*', '3 / *ييغر*', '3 / *مونكي*', '3 / *محققين صغار*',
      '3 / *أسوار في هجوم العمالقة*', '3 / *هيوغا*', '3 / *دريار*', '3 / *نمل*', '3 / *سحره*', '3 / *كهنة اينيل*', '3 / *فينلاند ساقا*', '3 / *سون*', '3 / *اصدقاء ايتشيغو*',
      
      // Multi-name Questions
      'اخوة الساكي', 'ملك الشياطين', 'الخونة الثلاثة', 'السانين الاسطوريين', 'اصدقاء غون', 'المفجرين الثلاثة', 'ابناء كاغويا', 'ابناء هاغورومو', 'اخوات هانكوك', 'اخوة كيلوا', 'ابناء ناروتو', 'اخوات ايتشيغو', 'بيجو الذيول التسع', 'كوارث كايدو'
    ];
  }

  // Send a random response if the condition is met
  if (responses) {
    let randomIndex = Math.floor(Math.random() * responses.length);
    let randomResponse = responses[randomIndex];
    await m.reply(randomResponse);
  }

  return !0;
};

export default handler;