let handler = m => m;

handler.all = async function(m) {
  // Access the chat object in the global database
  let chat = global.db.data.chats[m.chat];

  // Define the responses
  let responses;
  if (/^س$/i.test(m.text)) {
    responses = [
      '*سياف العناكب؟*', '*قاتل اوفوجين؟*', '*اعظم جنرال؟*', '*ملك الشياطين؟*', '*قائد العناكب*', '*سياف العناكب*', '*محرك ماكسيم*', '*هاشيرا الحب*', '*هاشيرا الصخر*', '*هاشيرا الماء*', '*معلم تانجيرو*', '*ملك الشينوبي*', '*امير السايان*', '*ملك الجحيم*', '*نائب لوفي*', '*الطاغية*', '*الاسد الذهبي*', '*سيف ميهوك*', '*سكين كرولو*', '*قاتل تنين النار*', '*اسم اول مايت*', '*معد كاراسونو*', '*اقوى مخلوق*', '*كلب الحمم*', '*بطل البحرية*', '*صانع قبعة القش*', '*ملاحة طاقم قبعة القش*', '*ام ناروتو*', '*اطلاق باراغان*', '*اطلاق يامي*', '*شيكاي كيسكي*', '*حبيبة اوكي*', '*بانكاي ياماموتو*', '*شيكاي ايزن*', '*شيكاي ياماموتو*', '*سفينة لوفي الجديدة*', '*سفينة لوفي القديمة*', '*سيف ايتاتشي*', '*اكسيد ناتسو*', '*اكسيد غاجيل*', '*تايتانيا*', '*قائد الثيران السوداء*', '*قائد الثوار*', '*خطيبة شينتشي*','*حارس يونا*','*اب ثورفين*','*الاسبادا الثالث*','*نائب كايدو*','*عيون اكاشي*','*ابن البحر*','*حارس امبل داون*','*اليونكو الخامس*','*قائد غران توريسمو*','*اخت سانجي*','*ملك القراصنة*','*يد روجر اليمنى*','*سيف روجر*','*اخ سابو*','*ملك التنانين*','*امير البحر*','*كيميائي الشعلة*', '*اسم هيسوكا*','*حصان جان فول(بيير)*', '*قمر علوي الثاني*', '*القمر العلوي الثالث*'
    ];
  }

  // Send a random response if the condition is met
  if (responses) {
    let randomIndex = Math.floor(Math.random() * responses.length);
    let randomResponse = responses[randomIndex];
    await conn.sendMessage(m.chat, randomResponse);
  }

  return !0;
};

export default handler;
